; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_10 ?v8 ?v11)
             (pred_6 ?v9 ?v1)
             (pred_8 ?v8 ?v1)
             (pred_2 ?v4 ?v8 )
	     (pred_1 ?v8)
             (pred_7 ?v3)
             (pred_9 ?v9)
             (pred_11 ?v1)
             (pred_3 ?v8)
             (pred_12 ?v9)
             (pred_5 ?v8)
             (pred_4 ))



(:action op_1
:parameters (?v2 ?v7 ?v10 ?v6)
:precondition (and (pred_7 ?v2) (pred_7 ?v7) (pred_9 ?v10) (pred_11 ?v6)
          (pred_10 ?v2 ?v7) (pred_6 ?v10 ?v6)
                   (pred_8 ?v7 ?v6) (pred_1 ?v2) 
                   (pred_3 ?v7) (pred_12 ?v10))
:effect (and  (pred_5 ?v7) (not (pred_3 ?v7))))


(:action op_2
:parameters (?v2 ?v12)
:precondition (and (pred_7 ?v2) (pred_7 ?v12)
               (pred_1 ?v2) (pred_10 ?v2 ?v12) (pred_5 ?v12))
:effect (and (pred_1 ?v12) (not (pred_1 ?v2))))

(:action op_4
:parameters (?v2 ?v10)
:precondition (and (pred_7 ?v2) (pred_9 ?v10) 
                  (pred_1 ?v2) (pred_2 ?v10 ?v2) (pred_4 ))
:effect (and (pred_12 ?v10)
   (not (pred_2 ?v10 ?v2)) (not (pred_4 ))))


(:action op_5
:parameters (?v2 ?v5 ?v13)
:precondition (and (pred_7 ?v2) (pred_9 ?v5) (pred_9 ?v13)
                  (pred_1 ?v2) (pred_12 ?v13) (pred_2 ?v5 ?v2))
:effect (and (pred_12 ?v5) (pred_2 ?v13 ?v2)
        (not (pred_12 ?v13)) (not (pred_2 ?v5 ?v2))))

(:action op_3
:parameters (?v2 ?v10)
:precondition (and (pred_7 ?v2) (pred_9 ?v10) 
                  (pred_1 ?v2) (pred_12 ?v10))
:effect (and (pred_4 ) (pred_2 ?v10 ?v2) (not (pred_12 ?v10)))))

; problem
(define (problem grid-5-5-3-4-4)
    (:domain grid)
    (:objects
    obj_21 obj_19 obj_10 obj_14 obj_16 obj_20 obj_04 obj_24 obj_03 obj_32 obj_23 obj_26 obj_08 obj_11 obj_25 obj_07 obj_30 obj_27 obj_22 obj_31 obj_12 obj_05 obj_29 obj_01 obj_06
    obj_18 obj_13 obj_28
    obj_02 obj_17 obj_15 obj_09
    )

    (:init
       (pred_4)

       (pred_7 obj_21)
       (pred_7 obj_19)
       (pred_7 obj_10)
       (pred_7 obj_14)
       (pred_7 obj_16)
       (pred_7 obj_20)
       (pred_7 obj_04)
       (pred_7 obj_24)
       (pred_7 obj_03)
       (pred_7 obj_32)
       (pred_7 obj_23)
       (pred_7 obj_26)
       (pred_7 obj_08)
       (pred_7 obj_11)
       (pred_7 obj_25)
       (pred_7 obj_07)
       (pred_7 obj_30)
       (pred_7 obj_27)
       (pred_7 obj_22)
       (pred_7 obj_31)
       (pred_7 obj_12)
       (pred_7 obj_05)
       (pred_7 obj_29)
       (pred_7 obj_01)
       (pred_7 obj_06)
       (pred_11 obj_18)
       (pred_11 obj_13)
       (pred_11 obj_28)
       (pred_9 obj_02)
       (pred_9 obj_17)
       (pred_9 obj_15)
       (pred_9 obj_09)

       (pred_10 obj_21 obj_20)
       (pred_10 obj_21 obj_19)
       (pred_10 obj_19 obj_04)
       (pred_10 obj_19 obj_10)
       (pred_10 obj_19 obj_21)
       (pred_10 obj_10 obj_24)
       (pred_10 obj_10 obj_14)
       (pred_10 obj_10 obj_19)
       (pred_10 obj_14 obj_03)
       (pred_10 obj_14 obj_16)
       (pred_10 obj_14 obj_10)
       (pred_10 obj_16 obj_32)
       (pred_10 obj_16 obj_14)
       (pred_10 obj_20 obj_23)
       (pred_10 obj_20 obj_04)
       (pred_10 obj_20 obj_21)
       (pred_10 obj_04 obj_26)
       (pred_10 obj_04 obj_24)
       (pred_10 obj_04 obj_19)
       (pred_10 obj_04 obj_20)
       (pred_10 obj_24 obj_08)
       (pred_10 obj_24 obj_03)
       (pred_10 obj_24 obj_10)
       (pred_10 obj_24 obj_04)
       (pred_10 obj_03 obj_11)
       (pred_10 obj_03 obj_32)
       (pred_10 obj_03 obj_14)
       (pred_10 obj_03 obj_24)
       (pred_10 obj_32 obj_25)
       (pred_10 obj_32 obj_16)
       (pred_10 obj_32 obj_03)
       (pred_10 obj_23 obj_07)
       (pred_10 obj_23 obj_26)
       (pred_10 obj_23 obj_20)
       (pred_10 obj_26 obj_30)
       (pred_10 obj_26 obj_08)
       (pred_10 obj_26 obj_04)
       (pred_10 obj_26 obj_23)
       (pred_10 obj_08 obj_27)
       (pred_10 obj_08 obj_11)
       (pred_10 obj_08 obj_24)
       (pred_10 obj_08 obj_26)
       (pred_10 obj_11 obj_22)
       (pred_10 obj_11 obj_25)
       (pred_10 obj_11 obj_03)
       (pred_10 obj_11 obj_08)
       (pred_10 obj_25 obj_31)
       (pred_10 obj_25 obj_32)
       (pred_10 obj_25 obj_11)
       (pred_10 obj_07 obj_12)
       (pred_10 obj_07 obj_30)
       (pred_10 obj_07 obj_23)
       (pred_10 obj_30 obj_05)
       (pred_10 obj_30 obj_27)
       (pred_10 obj_30 obj_26)
       (pred_10 obj_30 obj_07)
       (pred_10 obj_27 obj_29)
       (pred_10 obj_27 obj_22)
       (pred_10 obj_27 obj_08)
       (pred_10 obj_27 obj_30)
       (pred_10 obj_22 obj_01)
       (pred_10 obj_22 obj_31)
       (pred_10 obj_22 obj_11)
       (pred_10 obj_22 obj_27)
       (pred_10 obj_31 obj_06)
       (pred_10 obj_31 obj_25)
       (pred_10 obj_31 obj_22)
       (pred_10 obj_12 obj_05)
       (pred_10 obj_12 obj_07)
       (pred_10 obj_05 obj_29)
       (pred_10 obj_05 obj_30)
       (pred_10 obj_05 obj_12)
       (pred_10 obj_29 obj_01)
       (pred_10 obj_29 obj_27)
       (pred_10 obj_29 obj_05)
       (pred_10 obj_01 obj_06)
       (pred_10 obj_01 obj_22)
       (pred_10 obj_01 obj_29)
       (pred_10 obj_06 obj_31)
       (pred_10 obj_06 obj_01)
       (pred_3 obj_24)
       (pred_3 obj_08)
       (pred_3 obj_05)
       (pred_3 obj_27)
       (pred_8  obj_24 obj_18)
       (pred_8  obj_08 obj_13)
       (pred_8  obj_05 obj_28)
       (pred_8  obj_27 obj_18)
       (pred_5 obj_21)
       (pred_5 obj_19)
       (pred_5 obj_10)
       (pred_5 obj_14)
       (pred_5 obj_16)
       (pred_5 obj_20)
       (pred_5 obj_04)
       (pred_5 obj_03)
       (pred_5 obj_32)
       (pred_5 obj_23)
       (pred_5 obj_26)
       (pred_5 obj_11)
       (pred_5 obj_25)
       (pred_5 obj_07)
       (pred_5 obj_30)
       (pred_5 obj_22)
       (pred_5 obj_31)
       (pred_5 obj_12)
       (pred_5 obj_29)
       (pred_5 obj_01)
       (pred_5 obj_06)

       (pred_6  obj_02 obj_18)
       (pred_6  obj_17 obj_13)
       (pred_6  obj_15 obj_28)
       (pred_6  obj_09 obj_13)
       (pred_2 obj_02 obj_20)
       (pred_2 obj_17 obj_01)
       (pred_2 obj_15 obj_12)
       (pred_2 obj_09 obj_31)
       (pred_1 obj_10)
    )

    (:goal (and
       (pred_2 obj_17 obj_32)
    ))
(:constraints
  (always (not (pred_1 obj_22)))
)
)

; plan
1. (op_2 obj_10 obj_14)
   deleted: (pred_1 obj_10)
   added: (pred_1 obj_14)
   goals met: 0 of 1
2. (op_2 obj_14 obj_03)
   deleted: (pred_1 obj_14)
   added: (pred_1 obj_03)
   goals met: 0 of 1
3. (op_2 obj_03 obj_11)
   deleted: (pred_1 obj_03)
   added: (pred_1 obj_11)
   goals met: 0 of 1
4. (op_2 obj_11 obj_25)
   deleted: (pred_1 obj_11)
   added: (pred_1 obj_25)
   goals met: 0 of 1
5. (op_2 obj_25 obj_31)
   deleted: (pred_1 obj_25)
   added: (pred_1 obj_31)
   goals met: 0 of 1
6. (op_2 obj_31 obj_06)
   deleted: (pred_1 obj_31)
   added: (pred_1 obj_06)
   goals met: 0 of 1
7. (op_2 obj_06 obj_01)
   deleted: (pred_1 obj_06)
   added: (pred_1 obj_01)
   goals met: 0 of 1
8. (op_4 obj_01 obj_17)
   deleted: (pred_2 obj_17 obj_01) (pred_4)
   added: (pred_12 obj_17)
   goals met: 0 of 1
9. (op_2 obj_01 obj_06)
   deleted: (pred_1 obj_01)
   added: (pred_1 obj_06)
   goals met: 0 of 1
10. (op_2 obj_06 obj_31)
   deleted: (pred_1 obj_06)
   added: (pred_1 obj_31)
   goals met: 0 of 1
11. (op_2 obj_31 obj_25)
   deleted: (pred_1 obj_31)
   added: (pred_1 obj_25)
   goals met: 0 of 1
12. (op_2 obj_25 obj_32)
   deleted: (pred_1 obj_25)
   added: (pred_1 obj_32)
   goals met: 0 of 1
13. (op_3 obj_32 obj_17)
   deleted: (pred_12 obj_17)
   added: (pred_4) (pred_2 obj_17 obj_32)
   goals met: 1 of 1
